Repository: pingfangx/TranslatorX
Catalog: JetBrains/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: Use tab character
zh_cn: 使用制表符

source: Use the &shortcut:PasteMultiple; shortcut to choose and insert recent clipboard contents into the text.
zh_cn: 使用 &shortcut:PasteMultiple; 可以从最近的剪贴板内容中选择并插入到文本中。

source: Use the Project tool window instead: select one or more files, or folders, point to File | Line Separators on the main menu, and then choose the desired line ending style.
zh_cn: 只需在 Project tool window 选择一个或多个方件、文件夹，选择主菜单的 File | Line Separators ，然后选择所需的换行符。

source: Use the Tab key to move between the template fields.
zh_cn: 使用 Tab 键在模板字段间移动。

source: Use the Scope-Based tab in the TODO tool window to show only those items that pertain to the scope of interest.
zh_cn: 使用 TODO 工具窗口中的 ''Scope Based'' 选项卡仅显示与感兴趣的范围相关的项目。

source: Use the Switcher (&shortcut:Switcher;) to switch between open files and tool windows.
zh_cn: 使用切换器 (&shortcut:Switcher;) 在打开的文件和工具窗口间切换。

source: Use the default ruleset
zh_cn: 使用默认的规则集

source: Use the same context menu item to see the history of changes on a directory.
zh_cn: 使用相同的上下文菜单项来还可查看目录上的更改历史记录。

source: Use these icons to view and change colors.
zh_cn: 使用这些图标查看和更改颜色。

source: Use this name anyway?
zh_cn: 仍使用这个名字吗？

source: Use transparent mode for floating windows
zh_cn: 浮动窗口使用透明模式

source: Use variable &initializer to initialize parameter
zh_cn: 使用变量初始化器以初始化参数(&I)

source: Use {0} for path completion
zh_cn: 使用 {0} 补全路径

source: Use {0} to add to Watches
zh_cn: 使用 {0} 添加到观察点

source: Use {0} to keep tail of the path
zh_cn: 使用 {0} 来保持路径的尾部

source: Use {0} to syntactically correct your code after completing (balance parentheses etc.)
zh_cn: 补全代码后,使用 {0} 让代码语法正确(如平衡括号等.)

source: Used
zh_cn: 已使用

source: Used "{0}" as a substitute
zh_cn: 用 "{0}" 替代

source: Used Templates History
zh_cn: 已使用模板历史记录

source: Used from
zh_cn: 使用从

source: Used in
zh_cn: 用于

source: Used templates:
zh_cn: 使用的模板：

source: Useless null-check: {0} is never null
zh_cn: 无用的 null 检查： {0} 从不为 null

source: User
zh_cn: 用户

source: User name:
zh_cn: 用户名:

source: User task
zh_cn: 用户任务

source: User-defined template file ''{0}'' is not found
zh_cn: 未找到用户定义的模板文件 ''{0}''

source: User-defined template path is empty
zh_cn: 用户定义的模板路径为空

source: Uses service <a href="#javaClass/{0}">{0}</a><br><div style='margin-top: 5px'><font size='2'>Click to navigate</font></div>
zh_cn: 使用服务 <a href="#javaClass/{0}">{0}</a><br><div style='margin-top: 5px'><font size='2'>点击浏览</font></div>

source: Uses the following
zh_cn: 使用以下

source: Using &shortcut:Generate; (Code | Generate) in the editor, you can easily generate getter and setter methods for any fields of your class.
zh_cn: 在编辑器中使用 &shortcut:Generate; (Code | Generate) ，你可以很容易地为类中的任何字段生成 getter 和 setter 方法。

source: Using REST API
zh_cn: 使用 REST API

source: Using camel words prefixes in navigation popups
zh_cn: 在导航弹窗中使用驼峰词前缀

source: Using definition which type failed to load
zh_cn: 使用定义类型加载失败

source: Using this action multiple times will select the function name, then the expression that calls that function, then the whole statement, then the containing block, etc.
zh_cn: 多次使用此操作将选择函数名称，然后选择调用该函数的表达式，然后选择整个语句，然后选择包含块等。

source: Using wildcards in go to class, file or symbol
zh_cn: 在转到类、文件或符号中使用通配符

source: VCS Actions
zh_cn: VCS 操作

source: VCS Annotations//Background color #{0}
zh_cn: VCS 注释//背景色 #{0}

source: VCS Annotations//Foreground
zh_cn: VCS 注释//前景

source: VCS Group
zh_cn: VCS 组

source: VCS History Cache Settings
zh_cn: VCS 历史缓存设置

source: VCS Operations
zh_cn: VCS 操作

source: VCS/LVCS Actions
zh_cn: VCS/LVCS 操作

source: VCSannotate
zh_cn: VCS 注释

source: VCSdiff
zh_cn: VCS 差异

source: VCSoperations
zh_cn: VCS 操作

source: VC_S
zh_cn: VCS(_S)

source: VM Version Warning
zh_cn: 虚拟机版本警告

source: VM disconnected.
zh_cn: 虚拟机断开。

source: Valid XML document must have a root tag
zh_cn: 有效的 XML 文档必须具有根标记

source: Valid for {0} version {1}
zh_cn: 适用于 {0} 版本 {1}

source: Valid string escape
zh_cn: 有效字符串转义

source: Validate
zh_cn: 验证

source: Validate the current XML file
zh_cn: 校验当前的 XML 文件

source: Validate {0}
zh_cn: 验证 {0}

source: Validating backward reference indices
zh_cn: 验证反向引用索引

source: Validation
zh_cn: 验证

source: Validation Is Running
zh_cn: 验证正在运行

source: Validation is running.
zh_cn: 验证正在运行。

source: Value
zh_cn: 值

source: Value ''{0}'' is not an integer number
zh_cn: 值 ''{0}'' 不是整数

source: Value ''{0}'' is out of range {1}..{2}
zh_cn: 值 ''{0}'' 超出范围 {1}..{2}

source: Value auto tooltip
zh_cn: 自动提示值

source: Value expected
zh_cn: 期望值

source: Value for introduced parameter in that method call will be incorrect.
zh_cn: 该方法调用中引入的参数的值将不正确。

source: Value for the path variable "{0}" is not defined
zh_cn: 路径变量 "{0}" 的值未定义

source: Value is read
zh_cn: 值是读的

source: Value is written
zh_cn: 值是写的

source: Value must be identifier
zh_cn: 值必须是标识符

source: Value must not be empty
zh_cn: 值不能为空

source: Value overflow
zh_cn: 值溢出

source: Value read
zh_cn: 读值

source: Value should be integer
zh_cn: 值应该为整数

source: Value write
zh_cn: 写值

source: Value:
zh_cn: 值:

source: Vararg parameter must be the last in the list
zh_cn: 可变参数必须是列表中的最后一个

source: Vararg parameter should be the last in method signature
zh_cn: 可变参数应该在方法签名的最后

source: Variable
zh_cn: 变量

source: Variable ''{0}'' is accessed for writing
zh_cn: 变量 ''{0}'' 访问可写

source: Variable ''{0}'' is accessed from within inner class, needs to be declared final
zh_cn: 从内部类中访问变量 ''{0}''，需要声明为 final

source: Variable ''{0}'' is accessed from within inner class, needs to be final or effectively final
zh_cn: 变量 ''{0}'' 从内部类中访问，需要是 final 或有效的 final

source: Variable ''{0}'' is already declared
zh_cn: 变量 ''{0}'' 已经声明

source: Variable ''{0}'' is already defined in the scope
zh_cn: 变量 ''{0}'' 已经在范围内定义

source: Variable ''{0}'' is assigned but never accessed
zh_cn: 变量 ''{0}'' 被赋值但从未访问

source: Variable ''{0}'' is assigned to itself
zh_cn: 变量 ''{0}'' 被赋值给自己

source: Variable ''{0}'' is initialized with self assignment
zh_cn: 变量 ''{0}'' 是自我赋值初始化

source: Variable ''{0}'' is never assigned
zh_cn: 变量 ''{0}'' 从未赋值

source: Variable ''{0}'' is never used
zh_cn: 变量 ''{0}'' 从未使用

source: Variable ''{0}'' is not declared
zh_cn: 变量 ''{0}'' 没有被声明

source: Variable ''{0}'' might already have been assigned to
zh_cn: 变量 ''{0}'' 可能已经被分配给

source: Variable ''{0}'' might be assigned in loop
zh_cn: 可能在循环中分配变量 ''{0}''

source: Variable ''{0}'' might not have been initialized
zh_cn: 变量 ''{0}'' 可能尚未初始化

source: Variable <code>#ref</code> can have <code>final</code> modifier
zh_cn: 变量 <code>#ref</code> 可以有 <code>final</code> 修饰符

source: Variable arity methods
zh_cn: 可变方法

source: Variable expected
zh_cn: 期望变量

source: Variable is already assigned to this value
zh_cn: 变量已经赋给这个值

source: Variable is assigned to itself
zh_cn: 变量被赋值给自己

source: Variable name completion
zh_cn: 变量名补全

source: Variable of &type:
zh_cn: 变量类型:(&T)

source: Variable to inline
zh_cn: 要内联的变量

source: Variable used as a try-with-resources resource should be final or effectively final
zh_cn: 用作 try-with-resources 资源的变量应该是 final 或有效的 final

source: Variable used in lambda expression should be final or effectively final
zh_cn: 用于 lambda 表达式的变量应该是 final 或有效的 final

source: Variable with name {0} already exists
zh_cn: 变量的名字 {0} 已经存在

source: Variable {0} does not have an initializer.
zh_cn: 变量 {0} 没有初始化。

source: Variable {0} has no initializer
zh_cn: 变量 {0} 没有初始化

source: Variable {0} initializer {1} is redundant
zh_cn: 变量 {0} 的初始化 {1} 是多余的

source: Variable {0} is never used
zh_cn: 变量 {0} 从未使用

source: Variable {0} is never used before modification
zh_cn: 变量 {0} 在修改前永远不会使用

source: Variable {0} is referenced in multiple files
zh_cn: 变量 {0} 在多个文件中引用

source: Variables
zh_cn: 变量

source: Variables are not available
zh_cn: 变量不可用

source: Variables debug info not available
zh_cn: 变量调试信息不可用

source: Variables//Local variable
zh_cn: 变量//局部变量

source: Variables//Reassigned local variable
zh_cn: 变量//重新分配的局部变量

source: Velocity Error
zh_cn: 速度错误

source: Vendor
zh_cn: 提供者

source: Verbose or redundant code constructs
zh_cn: 冗余或多余的代码结构

source: Verification error : {0}
zh_cn: 验证错误: {0}

source: Verifying...
zh_cn: 验证...

source: Version
zh_cn: 版本

source: Version Control Configurations
zh_cn: 版本控制配置

source: Version Control Group
zh_cn: 版本控制组

source: Version Control Systems
zh_cn: 版本控制系统

source: Version control annotations show the latest changes of each line in one click.
zh_cn: 版本控制注释只需一次点击即可显示每一行的最新更改。

source: Version control settings can be configured in 'Settings | Version Control'
zh_cn: 版本控制设置可以在 '设置 | 版本控制' 中配置

source: Versions are identical
zh_cn: 版本是相同的

source: Vice versa, if a non-ASCII character is entered in the resource bundle editor, it is reflected in the underlying *.properties file as a corresponding escaped character in the format \uXXXX.
zh_cn: 反之，如果在资源束编辑器中输入了非 ASCII 字符，则它在原本的 *.properties 文件中将显示为 \uXXXX 格式的转义字符。

source: View
zh_cn: 视图

source: View Brea_kpoints...
zh_cn: 查看断点...(_K)

source: View Breakpoints
zh_cn: 查看断点

source: View External Documentation
zh_cn: 查看外部文档

source: View Mode
zh_cn: 视图模式

source: View PSI Structure of Cu_rrent File...
zh_cn: 查看当前文件的 PSI 结构...(_R)

source: View Recent Actions Group
zh_cn: 查看最近的操作组

source: View Text
zh_cn: 查看文本

source: View _Offline Inspection Results...
zh_cn: 查看离线检查结果...(_O)

source: View and manage all breakpoints and watchpoints
zh_cn: 查看和管理所有断点和观察点

source: View as
zh_cn: 作为...查看

source: View assertEquals Difference
zh_cn: 查看 assertEquals 差异

source: View complete information about the selected changelist
zh_cn: 查看选中更改列表的完整信息

source: View history of committed changes
zh_cn: 查看提交更改的历史记录

source: View short live demos introducing features of JetBrains products.
zh_cn: 查看关于 JetBrains 产品特点的简短现场演示。

source: View short live demos introducing features of {0}.
zh_cn: 查看关于 {0} 功能的简短现场演示。

source: View text value of selected node in a separate pane
zh_cn: 在单独的窗格中查看选中节点的文本值

source: View, Change, Record, Play Macros
zh_cn: 查看, 编辑, 录制, 播放宏

source: View/Edit Text
zh_cn: 查看/编辑文本

source: View/edit ignored updates
zh_cn: 查看/编辑忽略的更新

source: Views
zh_cn: 视图

source: Virtual File Info
zh_cn: 虚拟文件信息

source: Virtual Space
zh_cn: 虚拟空白

source: Visibility
zh_cn: 可见性

source: Visibility issues
zh_cn: 可见性问题

source: Visible from &outside of the scope only
zh_cn: 仅从外部可见的范围(&O)

source: Visual Edit Operation
zh_cn: 可视化编辑操作

source: Visual guides
zh_cn: 可视化指导

source: W&hole project
zh_cn: 整个项目(&H)

source: W&ords
zh_cn: 词(&O)

source: WAIT
zh_cn: 等待

source: WARNING
zh_cn: 警告

source: Waiting for process detach
zh_cn: 等待进程分离

source: Waiting until last debugger command completes
zh_cn: 等待最后一个调试器命令完成

source: Want to call an action but don't know its shortcut?
zh_cn: 想要调用某个操作但不知道其快捷方式？

source: Want to change a shortcut but don’t know its name?
zh_cn: 想更改一个快捷键，但不知道它的名字？

source: Want to see the list of all refactorings applicable to the symbol at the caret?
zh_cn: 想要查看适用于插入符号处的所有重构列表吗？

source: Want to see the list of all types that implement the interface or any of its methods at the caret, or to quickly navigate to one of them?
zh_cn: 想要查看在插入符处实现接口或其任何方法的所有类型的列表，还是要快速导航到其中的一个？

source: Warning
zh_cn: 警告

source: Warning : {0}
zh_cn: 警告 : {0}

source: Warning:
zh_cn: 警告:

source: Watch
zh_cn: 观察点

source: Watches
zh_cn: 观察点

source: Watches ({0})
zh_cn: 观察点 ({0})

source: Way too unbalanced.
zh_cn: 方式太不平衡。

source: We recommend using J2SDK 1.4.0_01 or higher.
zh_cn: 我们建议使用 J2SDK 1.4.001或更高的版本。(_0)

source: We recommend using the Oracle JRE/JDK.
zh_cn: 我们建议使用 Oracle JRE/JDK。

source: We wanted your IDE to receive upgrades over a secure connection.
zh_cn: 我们希望您的 IDE 在安全连接上接收升级。

source: We''re keeping the old format for now, for backwards compatibility.
zh_cn: 为了向后兼容，我们现在保留旧格式。

source: Web Browser
zh_cn: 网页浏览器

source: Web Browsers
zh_cn: Web 浏览器

source: Web Module
zh_cn: Web 模块

source: Web modules are used for developing Web applications using technologies such as <b>HTML/CSS, JavaScript, PHP</b> and so on.
zh_cn: Web 模块用于使用诸如 <b>HTML/CSS, JavaScript, PHP</b> 等技术开发 Web 应用程序。

source: Welcome to &productName; &majorVersion;.&minorVersion;
zh_cn: 欢迎使用 &productName; &majorVersion;.&minorVersion;

source: Welcome to &productName; &majorVersion;
zh_cn: 欢迎来到 &productName; &majorVersion;

source: Welcome to &productName; 5.0
zh_cn: 欢迎来到 &productName; &majorVersion;

source: Welcome to &productName; Productivity Guide
zh_cn: 欢迎来到 &productName; 生产力指南

source: Welcome to IntelliJ IDEA 5.0
zh_cn: 欢迎来到 IntelliJ IDEA 5.0

source: Welcome to IntelliJ IDEA Productivity Guide
zh_cn: 欢迎来到 &productName; 生产力指南

source: Welcome to PyCharm &majorVersion;.&minorVersion;
zh_cn: 欢迎使用 &productName; &majorVersion;.&minorVersion;

source: Welcome to PyCharm Productivity Guide
zh_cn: 欢迎来到 &productName; 生产力指南

source: Welcome to RubyMine &majorVersion;.&minorVersion;!
zh_cn: 欢迎使用 &productName; &majorVersion;.&minorVersion;

source: Welcome to RubyMine Productivity Guide
zh_cn: 欢迎来到 &productName; 生产力指南

source: Welcome!
zh_cn: 欢迎！

source: What do you want?
zh_cn: 你要怎么做？

source: What would you like to do?
zh_cn: 你想做什么?

source: What''s _New in {0}
zh_cn: {0} 更新说明(_N)

source: What's _New
zh_cn: 更新说明(_N)

source: What's new in IDEA 9
zh_cn: IDEA 9的新功能

source: When a project is only being created (File | New Project, or Create New Project on the Welcome screen).
zh_cn: 当项目仅被创建时 (File | New Project 或欢迎屏幕的 Create New Project)。

source: When an autopopup completion is active, &shortcut:EditorLookupDown; and &shortcut:EditorLookupUp; will close it and move the caret down or up in the editor.
zh_cn: 当一个自动弹窗被全激活时， &shortcut:EditorLookupDown; 和 &shortcut:EditorLookupUp; 将关闭它，并且在编辑器中上移或下移插入符号。

source: When choosing a live template from a suggestion list, press &shortcut:QuickJavaDoc; to view quick documentation - to be sure you make a right choice:
zh_cn: 在从建议列表中选择一个代码模板时，按 &shortcut:QuickJavaDoc; 查看快速文档——以确保你做出正确的选择。

source: When closing active editor:
zh_cn: 关闭活动编辑器时:

source: When comparing two files or two revisions of the same file, click the arrow icons to apply changes from one side to another.
zh_cn: 在比较同一文件的两个文件或两个修订版本时，单击箭头图标可将更改从一侧应用到另一侧。

source: When debugging, you can evaluate an arbitrary expression in the context of the current stack frame by pressing &shortcut:QuickEvaluateExpression; (Run | Evaluate Expression).
zh_cn: 调试时，您可以通过按 &shortcut:QuickEvaluateExpression;(Run | Evaluate Expression)来计算当前堆栈帧上下文中的任意表达式。

source: When debugging, you can quickly evaluate an arbitrary expression from the editor – left-click the expression while holding Alt.
zh_cn: 调试时，您可以快速评估编辑器中的任意表达式/在按住 Alt 的同时左键单击该表达式。

source: When expanding a node
zh_cn: 当扩展一个节点的时候

source: When files are created with IDEA:
zh_cn: 当文件被 IDEA 创建时:

source: When files are created with {0}:
zh_cn: 当 {0} 创建文件时：

source: When files are deleted with IDEA:
zh_cn: 当文件被 IDEA 删除时:

source: When files are deleted with {0}:
zh_cn: 当 {0} 删除文件时：

source: When in a Code Completion lookup, press &shortcut:QuickJavaDoc; to show documentation for a lookup item, including class constructors.
zh_cn: 当显示代码补全的可选列表时，可以按下 &shortcut:QuickJavaDoc; 来显示当前查看项的文档，包括类的构造函数。

source: When in code completion lookup, use "CamelHumps" prefixes to narrow down the matches.
zh_cn: 在代码完成查找时，使用 "CamelHumps" 前缀来缩小匹配范围。

source: When in the Code Completion lookup, you can ease the search by filtering the list with the help of the "camel words" prefixes.
zh_cn: 在代码补全的查找中，您可以借助 "驼峰词" 前缀过滤列表，来轻松完成搜索。

source: When in the Go to Class, Go to Symbol, or Go to File popup, you can ease the search by filtering the lookup list with the help of the "camel words" prefixes.
zh_cn: 当在 转到类， 转到符号 或者 转到文件 弹窗时，您可以借助 "驼峰词" 前缀过滤查阅列表，来轻松完成搜索。

source: When later you'll look through the list in search of a particular breakpoint, just start typing its name:
zh_cn: 稍后，您将查看列表以查找特定断点，只需输入其名称即可：

source: When multiline
zh_cn: 当多行时

source: When multiple choices are available, they are shown in the lookup list.
zh_cn: 当有多个选择可用时，它们将显示在查阅列表中。

source: When no text is selected in the editor, the "Copy" command selects and copies the current line.
zh_cn: 当编辑器中没有选择任何文本时，"复制" 命令选择并复制当前行。

source: When nothing is selected in the editor, the line at the cursor will be moved.
zh_cn: 当编辑器中没有选择任何内容时，光标所在的行将被移动。

source: When ready, just press &shortcut:EditorEscape; to close the regular expression editor.
zh_cn: 准备好后，只需按 &shortcut:EditorEscape; 来关闭正则表达式编辑器。

source: When rendering a node
zh_cn: 当渲染一个节点的时候

source: When searching for a text string in a file, use recent history: with the search pane already open, click the down arrow to show the list of recent entries.
zh_cn: 在文件中搜索文本字符串时，可以使用最近的历史记录：搜索窗格打开时，点击向下箭头来显示最近的记录。

source: When searching for a text string in a file, use recent history: with the search pane already open, click the search icon to show the list of recent entries.
zh_cn: 在文件中搜索文本字符串时，请使用近期记录：在搜索窗格已打开的情况下，单击搜索图标以显示最近条目的列表。

source: When searching for a text string in a file, use recent history: with the search pane already open, press &shortcut:Find; once again to show the list of recent entries.
zh_cn: 在文件中搜索文本字符串时，可以使用最近的历史记录：搜索窗格打开时，再按一次 &shortcut:Find; 来显示最近的记录。

source: When the expected type is specified as a docstring, PyCharm provides code completion that suggests elements of the corresponding type:
zh_cn: 当期望的类型被一个文档字符串批定时，PyCharm 提供建议相应类型元素的代码补全：

source: When there is no selection, the line at the cursor will be moved.
zh_cn: 当没有选择时，光标处的行将被移动。

source: When typing the expression, you can use &shortcut:CodeCompletion; just like in the editor.
zh_cn: 输入表达式时，可以使用 &shortcut:CodeCompletion;，就像在编辑器中一样。

source: When using Code Completion in Java, you can accept the currently highlighted selection in the popup list with the exclamation sign (!) character.
zh_cn: 在 Java 中使用代码补全时，您可以使用感叹号(!)字符来接受弹出列表中当前高亮的选项。

source: When using Code Completion, you can accept the currently highlighted selection in the popup list with &shortcut:EditorChooseLookupItemReplace; key.
zh_cn: 当使用代码补全时，你可以使用 &shortcut:EditorChooseLookupItemReplace; 来接受弹窗列表中当前高亮的选项。

source: When using Code Completion, you can accept the currently highlighted selection in the popup list with the &shortcut:EditorChooseLookupItemCompleteStatement;, &productName; will not just insert the selected string, but also will do its best to turn current code construct into syntactically correct one (balance parentheses, add missing braces and semicolons, etc.)
zh_cn: 使用代码补全时，你可使用 &shortcut:EditorChooseLookupItemCompleteStatement; 来接受弹出列表中当前高亮的项目， &productName; 不仅会插入所选字符串，还会尽力将当前代码调整为语法正确的结构(平衡括号，添加缺少的大括号、分号等)。

source: When using Code Completion, you can accept the currently highlighted selection in the popup list with the &shortcut:EditorChooseLookupItemCompleteStatement;, IntelliJ IDEA will not just insert the selected string, but also will do its best to turn current code construct into syntactically correct one (balance parentheses, add missing braces and semicolons, etc.)
zh_cn: 使用代码补全时，你可使用 &shortcut:EditorChooseLookupItemCompleteStatement; 来接受弹出列表中当前高亮的项目， &productName; 不仅会插入所选字符串，还会尽力将当前代码调整为语法正确的结构(平衡括号，添加缺少的大括号、分号等)。

source: When using Code Completion, you can accept the currently highlighted selection in the popup list with the period character (.), comma (,), semicolon (;), space and other characters.
zh_cn: 当使用代码补全时，你可以使用句号(.)，逗号 (,)，分号(;)，空格及其他字符来接受弹出列表中当前高亮的选中项。

source: When using autopopup Code Completion, you can select the first item using &shortcut:EditorChooseLookupItemDot;.
zh_cn: 使用自动弹窗的代码补全时，你可以用 &shortcut:EditorChooseLookupItemDot; 来选择第一行。

source: When using basic code completion (&shortcut:CodeCompletion;), type any characters that exist anywhere in an identifier.
zh_cn: 使用基本代码补全时 (&shortcut:CodeCompletion;)，可以输入任何标识符中任何位置的任何字符。

source: When using basic code completion (&shortcut:CodeCompletion;), you don't need to type upper-case letters in CamelHump names.
zh_cn: 使用基本代码补全时(&shortcut:CodeCompletion;)，你不需要在驼峰样式的名字中输入大写字母。

source: When working with a lengthy list of tasks, you don't need to delete them one by one.
zh_cn: 当使用冗长的任务列表时，您不需要逐个删除它们。

source: When you are finding text in the current file (&shortcut:Find;), you don't need to type the whole search string: Basic Code Completion is available in the search field.
zh_cn: 当你在当前文件中查找文件时 (&shortcut:Find;)，你不需要输入整个查找字符串，在搜索字段时，基本代码补全是可以使用的。

source: When you close a code block by typing a closing curly brace ('}'), the editor automatically adjusts its position on the line according to your code style preferences (see "Source Code" page in the IDE Options dialog).
zh_cn: 当您通过键入关闭大括号( '}' )关闭代码块时，编辑器会根据代码样式首选项自动调整它的行位置(请参阅“IDE 选项”对话框中的“Source Code”页)。

source: When you commit a changelist, and type the check-in comment, make sure it matches one of your issue navigation patterns.
zh_cn: 当你提交一个变更列表，并输入检入注释时，确保注释匹配你的问题导航模式。

source: When you copy something to the clipboard, the IDE doesn't erase the previous entry but keeps it in a queue so you can paste it from there later.
zh_cn: 将某些内容复制到剪贴板时，IDE 不会擦除上一个条目，而是将其保留在队列中，以便稍后将其粘贴。

source: When you invoke the Move refactoring (&shortcut:Move;) on a nested class that is declared static, you are provided with an option to either make it a top-level class, or move it to another class.
zh_cn: 当你在一个申明为 static 的嵌套类上执行 Move 重构时 (&shortcut:Move;) ，你可以选择一个选项，使其成为项级类，或者将其移到另一个类。

source: When you invoke the Move refactoring (&shortcut:Move;) on an inner class that is declared static, you are provided with an option to either make it a top-level class, or move it to another class.
zh_cn: 当你在一个申明为 static 的内部类上执行 Move 重构时 (&shortcut:Move;) ，你可以选择一个选项，使其成为项级类，或者将其移到另一个类。

source: When you invoked Basic Completion (&shortcut:CodeCompletion;) in Java and didn't find your desired class in the list, it means that it's not yet imported in current file.
zh_cn: 当你在 Java 中使用基本补全时 (&shortcut:CodeCompletion;) ，如果没有在列表中找到你所需的类，这意味着它没有导入到当前文件中。

source: When you need a struct at the caret to implement an interface, press &shortcut:ImplementMethods; (Code | Implement Methods) or &shortcut:ShowIntentionActions;, and then choose the corresponding quick-fix.
zh_cn: 当你需要一个结构在插入符号来实现一个接口时，按 &shortcut:ImplementMethods;(Code | Implement Methods)或＆快捷键：ShowIntentionActions; </-s2>，然后选择相应的快速修复。

source: When you need to cast an expression value to the required type the SmartType code completion will help you.
zh_cn: 当您需要将表达式值转换为所需类型时，智能代码补全将帮助您。

source: When you paste a text block into your code, &productName; helps you by autoindenting it to fit the new location.
zh_cn: 将文本块粘贴到代码中时，&productName; 帮助您自动缩进来适应新的位置。

source: When you paste a text block into your code, IntelliJ IDEA helps you by autoindenting it to fit the new location.
zh_cn: 将文本块粘贴到代码中时，&productName; 帮助您自动缩进来适应新的位置。

source: When you perform any kind of project-wide search (usage search, multi-file textual search) you may easily export its results to a text file or to the system clipboard.
zh_cn: 当您执行任何类型的项目范围搜索(使用搜索，多文件文本搜索)时，您可以轻松地将其结果导出到文本文件或系统剪贴板。

source: When you perform search and replace in a file, pressing &shortcut:Find; shows the search pane.
zh_cn: 当你在一个文件中执行搜索和替换时，按 &shortcut:Find; 显示搜索面板。

source: When you press &shortcut:ShowIntentionActions; to invoke a quick fix or intention action, press the right arrow key to reveal the list of additional options.
zh_cn: 当你按下 &shortcut:ShowIntentionActions; 来调用快速修复或建议操作时，按右方向键可显示额外的选项列表。

source: When you press the &shortcut:EditorLineEnd; key on an empty line, the caret is positioned to the place where you most likely will start typing on this line (Smart End).
zh_cn: 当你在空行按下 &shortcut:EditorLineEnd; 时，插入符将定位到该行中你最可能开始输入的位置 (Smart End(智能结尾))。

source: When you run or debug your program and some exception is traced in the console view you may easily navigate to source code lines of this stack trace.
zh_cn: 当您运行或调试程序并且在控制台视图中跟踪一些异常时，您可以轻松地导航到此堆栈跟踪的源代码行。
